# St7GetResFileFreedomCase

Returns the freedom case associated with the custom result file.

long St7GetResFileFreedomCase(long uID, long* CaseNum)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
CaseNum
Freedom case number.
Applicability
Applicable to linear buckling and natural frequency custom result files.